# Тест на _set_total_posts_in_domain - нужен будет мок на requests
# Тест на fetch_posts - нужен мок на асинхронный реквест, мда
# Тест на posts_as_schemas - просто все
# тест на то, что адрес не существует
# тест на то, что указано amount_to_fetch
# тест, что указано sort by likes или нет

# Нужен мок, в общем, который будет возвращать шаблоны того, что может прийти из VK
# надо будет покурить, как это делается, по шаблону.

# Мок возвратит count, и возвратит под этот count всякие данные.
# Но надо же еще протестировать, если у нас больше чем 500 постов, чтобы они разделились
